{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "filters": 32, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "padding": "valid", "batch_input_shape": [null, 28, 28, 1]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 64, "kernel_constraint": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 128, "activation": "relu", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 27, "activation": "softmax", "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null}}], "keras_version": "2.0.5", "backend": "tensorflow"}